Lisltria/nrf52-keyboard/application/main/src/ble/ble_services.c
    ble_gap_addr_t ble_addr;
    sd_ble_gap_addr_get(&ble_addr);

    for (uint8_t i = 0; i < 3; i++) {
        uint8_t addr = ble_addr.addr[3 + i];
        device_name[offset++] = lookup_table[addr / 16];
        device_name[offset++] = lookup_table[addr % 16];
    }
    device_name[offset] = 0x00;
}
#endif

/**
 * @brief 设置蓝牙设备的名称
 * 
 */
static void set_device_name(void)
{
    ret_code_t err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

#ifdef MACADDR_SEPRATOR
    int orig_len = strlen(DEVICE_NAME);
    int name_len = orig_len + 8;
    char device_name[name_len];
    get_device_name(device_name, orig_len);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t*)device_name, strlen(device_name));
#else
    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t*)DEVICE_NAME, strlen(DEVICE_NAME));
#endif
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief 清空所有绑定数据.
 */
void delete_bonds(void)
{
    ret_code_t err_code;

    ble_disconnect();

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
#ifdef MULTI_DEVICE_SWITCH
    //清空所有绑定后，自动回到首个设备
    switch_id = 10; //将switch_id设置为无效ID
    switch_device_id_write(0);
    switch_device_select(0);
#endif
}

#ifdef MULTI_DEVICE_SWITCH
//注册switch需要的存储区
CONFIG_SECTION(switch_device_id, 1);
/**@brief 读取switch id.
 *
 */
uint8_t switch_device_id_read(void)
{
    return switch_device_id.data[0];
}
/**@brief 写入switch id.
 *
 */
void switch_device_id_write(uint8_t val)
{
    if (switch_device_id.data[0] != val) {
        switch_device_id.data[0] = val;
        storage_write((1 << STORAGE_CONFIG));
    }
}

/**@brief 删除当前设备绑定数据.
 *
 * 查找并删除与当前gap addr绑定的绑定数据
 */
static void peer_list_find_and_delete_bond(void)
{
    pm_peer_id_t peer_id;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    while (peer_id != PM_PEER_ID_INVALID) {
        uint16_t length = 8;
        uint8_t addr[8];

        if (pm_peer_data_app_data_load(peer_id, addr, &length) == NRF_SUCCESS) {
            if (addr[3] == switch_id) {
                pm_peer_delete(peer_id);
            }
        }

        peer_id = pm_next_peer_id_get(peer_id);
    }
}

/**
 * @brief 切换连接设备.
 *
 * @param[in] id  要切换的设备的ID号
 */
void switch_device_select(uint8_t id)
{
    ret_code_t ret;
    ble_gap_addr_t gap_addr;
//如果启用USB功能，当切换设备时，先禁用USB
#ifdef HAS_USB
    if (usb_working()) {
        usb_comm_switch();
    }
#endif
    // 如果重复切换，则直接退出，不做任何操作
    if (id == switch_id) {
        return;
    } else {
        ble_disconnect();
    }
    switch_id = id;

    switch_device_id_write(id);

    ret = sd_ble_gap_addr_get(&gap_addr);
    APP_ERROR_CHECK(ret);

    gap_addr.addr[3] = id;

    ret = sd_ble_gap_addr_set(&gap_addr);
    APP_ERROR_CHECK(ret);

    trig_event_param(USER_EVT_BLE_DEVICE_SWITCH, id);
}

/**
 * @brief 重新绑定当前设备.
 *
 */
void switch_device_rebond()
{
    peer_list_find_and_delete_bond();
    uint8_t rebond_id = switch_id;
    switch_id = 10; //将switch_id设置为无效ID
    switch_device_select(rebond_id);
}
/**
 * @brief 切换连接设备初始化.
 *
 * 读取存储的当前连接设备ID，并激活为当前连接设备
 */
void switch_device_init()
{

    ret_code_t ret;
    ble_gap_addr_t gap_addr;
    switch_id = switch_device_id_read();

    ret = sd_ble_gap_addr_get(&gap_addr);
    APP_ERROR_CHECK(ret);

    gap_addr.addr[3] = switch_id;

    ret = sd_ble_gap_addr_set(&gap_addr);
    APP_ERROR_CHECK(ret);
}
#endif

#ifdef ENABLE_SCAN
/**@brief Function for initializing the scanning.
 */
static void scan_start(void)
{
    ret_code_t err_code;

    SEGGER_RTT_printf(0, "start scan_start\n");
    err_code = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(err_code);

}
#endif

/**
 * @brief 开启蓝牙广播.
 * 
 * @param[in] erase_bonds  是否清空所有绑定数据
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds) {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    } else {
#ifdef ENABLE_SCAN
        scan_start();
#endif
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
        ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
    }
}

/**
 * @brief 重新开启蓝牙广播.
 * 
 * @param[in] mode  广播模式
 * @param[in] whitelist  是否启用白名单
 */
void advertising_restart(ble_adv_mode_t mode, bool reset)
{
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        sd_ble_gap_adv_stop(m_advertising.adv_handle);
        ble_advertising_start(&m_advertising, mode);
    } else {
        sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }

    if (reset) {
        ble_advertising_restart_without_whitelist(&m_advertising);
    }
}

/**
 * @brief 蓝牙进入慢速广播模式
 * 
 */
void advertising_slow()
{
    ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_SLOW);
    APP_ERROR_CHECK(ret);
}

#ifndef MULTI_DEVICE_SWITCH
static void disconnect(uint16_t conn_handle, void* p_context)
{
    UNUSED_PARAMETER(p_context);

    sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}
#endif

static void advertising_config_get(ble_adv_modes_config_t* p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));
#ifdef MULTI_DEVICE_SWITCH
    p_config->ble_adv_whitelist_enabled = true;
#else
    p_config->ble_adv_whitelist_enabled = false;
#endif
    p_config->ble_adv_directed_high_duty_enabled = true;
    p_config->ble_adv_directed_enabled = false;
    p_config->ble_adv_directed_interval = 0;
    p_config->ble_adv_directed_timeout = 0;
    p_config->ble_adv_fast_enabled = true;
    p_config->ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    p_config->ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
    p_config->ble_adv_slow_enabled = true;
    p_config->ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
    p_config->ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;
    p_config->ble_adv_on_disconnect_disabled = false;
    p_config->ble_adv_extended_enabled = false;
    p_config->ble_adv_primary_phy = BLE_GAP_PHY_1MBPS;
}

#ifdef BUTTONLESS_DFU
/**
 * @brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event) {
    case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE: {
        // Prevent device from advertising on disconnect.
        ble_adv_modes_config_t config;
        advertising_config_get(&config);
        config.ble_adv_on_disconnect_disabled = true;
        ble_advertising_modes_config_set(&m_advertising, &config);

        // Disconnect all other bonded devices that currently are connected.
        // This is required to receive a service changed indication
        // on bootup after a successful (or aborted) Device Firmware Update.
        ble_conn_state_for_each_connected(disconnect, NULL);
        break;
    }

    case BLE_DFU_EVT_BOOTLOADER_ENTER:
        // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
        //           by delaying reset by reporting false in app_shutdown_handler
        break;

    case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
        // YOUR_JOB: Take corrective measures to resolve the issue
        //           like calling APP_ERROR_CHECK to reset the device.
        APP_ERROR_CHECK(false);
        break;

